app/controllers/posts_controller.rb

  def create

    @user = User.find(session[:user_id])
    @post = @user.posts.build(params[:post])
    if @post.save
---
SELECT * FROM "users" WHERE ("users"."id" = 1)
INSERT INTO "posts" ("created_at", "updated_at", "user_id", "content") VALUES('2011-10-28 18:23:38', '2011-10-28 18:23:38', 1, NULL)